---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LegendComponentDetailLevel
source: html/cb9c915d-b037-f650-6b4b-56736d7ac233.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LegendComponentDetailLevel Property

"Detail Level"

## Syntax (C#)
```csharp
public static ForgeTypeId LegendComponentDetailLevel { get; }
```